app/code/Kensium/Amconnector/etc/amconnector/ShipmentSchema.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <GetList xmlns="http://www.acumatica.com/entity/5.30.001/Default/">
            <entity xsi:type="ShipVia">
                <ID xsi:nil="true"/>
                <Delete>false</Delete>
                <CarrierID xsi:nil="true"/>
                <Description xsi:nil="true"/>
                <Packages xsi:nil="true"/>
            </entity>
            <returnFullEntities>true</returnFullEntities>
        </GetList>
    </soap:Body>
</soap:Envelope>

